<?php
/*----------------------------------------------------------------------------------------------------------------------
  Проверка корректности входа в систему
  ----------------------------------------------------------------------------------------------------------------------
  User: E. Ryabov
  Date: 28.08.2018
  Time: 11:36:00
  ----------------------------------------------------------------------------------------------------------------------
*/
  $cPassword = $_POST['txtPassword'];
  $nUserId = -1;
  $cUserName = "";
  $cUserLogin = "";
  $nUserRole = 0;
  $cUserPhone = "";
  $cUserEmail = "";
  $nOk = 0;

  if ($cPassword == "19"){
    $nUserId = 19;
    $cUserLogin = "ttt";
    $cUserName = "Админов В.Г.";
    $nUserRole = "admin";
    $nOk = 1;
  }

  echo "{";
  echo "\"Id\" : \"" .   $nUserId . "\",";
  echo "\"Name\" : \"" . $cUserName . "\",";
  echo "\"Login\" : \"". $cUserLogin."\",";
  echo "\"Role\" : \"".  $nUserRole."\",";
  echo "\"bOk\" : \"".   $nOk ."\"";
  echo "}";

?>
